//Частота кадров
window.fps = 32;

//Картинка игрока
var yoba = new Image();
yoba.src = 'images/yoba.png';

//Картинка стены
var wall = new Image();
wall.src = 'images/wall.png';

//Картинка фона
var default_wall = new Image();
default_wall.src = 'images/default.png';

window.addEventListener('load', function(){
    //матрица карты
    window.matrix = [
        [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,1,1,1,1,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [1,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]
    ];

    //сцена
    window.scene = new Scene({
        canvas: 'scene',
        cellSize: 32,
        matrix: matrix
    });

    scene.initMatrix();

    //игрок
    window.player = new Player(scene, function(){
        this.ctx.drawImage(yoba, this.x, this.y);
    }, {
        radius: 16,
        x: 100,
        y: 100,
        offsetX: 32,
        offsetY: 32,
        width: 32,
        height: 32
    });

    //поключение управления игроком клавишами
    player.doMove();

    //кадр
    function draw(){
        scene.ctx.save();
        scene.clear();
        scene.drawMatrix();
        player.render();
        scene.ctx.restore();
    }

    setInterval(draw, fps);
});